cf-src/Enums/СтатусыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КПодтверждению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРезерве</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОтгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf-src/Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаказКлиента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РезервыТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоРезерв</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf-src/CommonModules/ИнтеграцияJSON/Ext/Module.bsl
#Если Сервер Тогда

Функция ПрочитатьJSONИзФайла(ПутьКФайлу) Экспорт

	Если ПустаяСтрока(ПутьКФайлу) Тогда
		ВызватьИсключение "Не указан путь к JSON-файлу.";
	КонецЕсли;
	
	Если НЕ ФайлСуществует(ПутьКФайлу) Тогда
		ВызватьИсключение СтрШаблон("Файл не найден: %1", ПутьКФайлу);
	КонецЕсли;
	
	ТекстJSON = Новый ЧтениеТекста(ПутьКФайлу, КодировкаТекста.UTF8).Прочитать();
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(ТекстJSON);
	
	Возврат ПрочитатьJSON(Чтение);

КонецФункции

Функция ЗагрузитьЗаказКлиентаИзJSON(ДанныеJSON) Экспорт

	Если ТипЗнч(ДанныеJSON) <> Тип("Структура") Тогда
		ВызватьИсключение "Ожидалась структура JSON-данных заказа.";
	КонецЕсли;
	
	ИмяКлиента = ПолучитьСтроковоеПоле(ДанныеJSON, "Клиент");
	ИмяСклада = ПолучитьСтроковоеПоле(ДанныеJSON, "Склад");
	ИмяВидаЦен = ПолучитьСтроковоеПоле(ДанныеJSON, "ВидЦен");
	
	Клиент = Справочники.Контрагенты.НайтиПоНаименованию(ИмяКлиента);
	Склад = Справочники.Склады.НайтиПоНаименованию(ИмяСклада);
	ВидЦен = Справочники.ВидыЦен.НайтиПоНаименованию(ИмяВидаЦен);
	
	Если НЕ ЗначениеЗаполнено(Клиент) Тогда
		ВызватьИсключение СтрШаблон("Клиент '%1' не найден.", ИмяКлиента);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		ВызватьИсключение СтрШаблон("Склад '%1' не найден.", ИмяСклада);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ВидЦен) Тогда
		ВызватьИсключение СтрШаблон("Вид цен '%1' не найден.", ИмяВидаЦен);
	КонецЕсли;
	
	Заказ = Документы.ЗаказКлиента.СоздатьДокумент();
	Заказ.Дата = ТекущаяДата();
	Заказ.Клиент = Клиент;
	Заказ.Склад = Склад;
	Заказ.ВидЦен = ВидЦен;
	Заказ.Статус = Перечисления.СтатусыЗаказов.Черновик;
	
	Товары = ПолучитьТабличныеДанные(ДанныеJSON, "Товары");
	
	Для каждого СтрокаJSON Из Товары Цикл
		НоменклатураИмя = ПолучитьСтроковоеПоле(СтрокаJSON, "Номенклатура");
		Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(НоменклатураИмя);
		
		Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
			ВызватьИсключение СтрШаблон("Номенклатура '%1' не найдена.", НоменклатураИмя);
		КонецЕсли;
		
		НоваяСтрока = Заказ.Товары.Добавить();
		НоваяСтрока.Номенклатура = Номенклатура;
		НоваяСтрока.Количество = ПолучитьЧисловоеПоле(СтрокаJSON, "Количество");
		НоваяСтрока.Цена = ПолучитьЧисловоеПоле(СтрокаJSON, "Цена");
		НоваяСтрока.КоличествоРезерв = НоваяСтрока.Количество;
	КонецЦикла;
	
	Заказ.Записать();
	
	Возврат Заказ.Ссылка;

КонецФункции

Функция ПолучитьСтроковоеПоле(Источник, ИмяПоля)
	Если НЕ Источник.Свойство(ИмяПоля) Тогда
		ВызватьИсключение СтрШаблон("В JSON отсутствует поле '%1'.", ИмяПоля);
	КонецЕсли;
	Возврат Строка(Источник[ИмяПоля]);
КонецФункции

Функция ПолучитьЧисловоеПоле(Источник, ИмяПоля)
	Если НЕ Источник.Свойство(ИмяПоля) Тогда
		ВызватьИсключение СтрШаблон("В JSON отсутствует поле '%1'.", ИмяПоля);
	КонецЕсли;
	Возврат Число(Источник[ИмяПоля]);
КонецФункции

Функция ПолучитьТабличныеДанные(Источник, ИмяПоля)
	Если НЕ Источник.Свойство(ИмяПоля) Тогда
		ВызватьИсключение СтрШаблон("В JSON отсутствует поле '%1'.", ИмяПоля);
	КонецЕсли;
	Если ТипЗнч(Источник[ИмяПоля]) <> Тип("Массив") Тогда
		ВызватьИсключение СтрШаблон("Поле '%1' должно быть массивом.", ИмяПоля);
	КонецЕсли;
	Возврат Источник[ИмяПоля];
КонецФункции

#КонецЕсли
